HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/**
 * \file IfxSdma_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Sdma_Cfg Sdma address
 * \ingroup IfxLld_Sdma
 * 
 * \defgroup IfxLld_Sdma_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Sdma_Cfg
 * 
 * \defgroup IfxLld_Sdma_Cfg_Sdma 2-SDMA
 * \ingroup IfxLld_Sdma_Cfg
 * 
 */
#ifndef IFXSDMA_REG_H
#define IFXSDMA_REG_H 1
/******************************************************************************/
#include "IfxSdma_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_Cfg_BaseAddress
 * \{  */

/** \\brief  SDMA object */
#define MODULE_SDMA /*lint --e(923)*/ ((*(Ifx_SDMA*)0xF0010000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_Cfg_Sdma
 * \{  */

/** \\brief  8FC, SDMA Sub-block Access Enable Register 0 */
#define SDMA_BLK0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ACCEN0*)0xF00108FCu)

/** Alias (User Manual Name) for SDMA_BLK0_ACCEN0.
* To use register names with standard convension, please use SDMA_BLK0_ACCEN0.
*/
#define	SDMA_ACCEN00	(SDMA_BLK0_ACCEN0)

/** \\brief  8F8, SDMA Sub-block Access Enable Register 1 */
#define SDMA_BLK0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ACCEN1*)0xF00108F8u)

/** Alias (User Manual Name) for SDMA_BLK0_ACCEN1.
* To use register names with standard convension, please use SDMA_BLK0_ACCEN1.
*/
#define	SDMA_ACCEN01	(SDMA_BLK0_ACCEN1)

/** \\brief  8C, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH0_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001008Cu)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_ADRCR.
*/
#define	SDMA_ADRCR000	(SDMA_BLK0_CH0_ADRCR)

/** \\brief  84, SDMA Channel Control Register */
#define SDMA_BLK0_CH0_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0010084u)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_CHCR.
*/
#define	SDMA_CHCR000	(SDMA_BLK0_CH0_CHCR)

/** \\brief  88, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH0_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0010088u)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_CHICR.
*/
#define	SDMA_CHICR000	(SDMA_BLK0_CH0_CHICR)

/** \\brief  80, SDMA Channel Status Register */
#define SDMA_BLK0_CH0_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0010080u)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_CHSR.
*/
#define	SDMA_CHSR000	(SDMA_BLK0_CH0_CHSR)

/** \\brief  94, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH0_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0010094u)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_DADR.
*/
#define	SDMA_DADR000	(SDMA_BLK0_CH0_DADR)

/** \\brief  90, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH0_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0010090u)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_SADR.
*/
#define	SDMA_SADR000	(SDMA_BLK0_CH0_SADR)

/** \\brief  98, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH0_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0010098u)

/** Alias (User Manual Name) for SDMA_BLK0_CH0_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH0_SHADR.
*/
#define	SDMA_SHADR000	(SDMA_BLK0_CH0_SHADR)

/** \\brief  AC, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH1_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF00100ACu)

/** Alias (User Manual Name) for SDMA_BLK0_CH1_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_ADRCR.
*/
#define	SDMA_ADRCR001	(SDMA_BLK0_CH1_ADRCR)

/** \\brief  A4, SDMA Channel Control Register */
#define SDMA_BLK0_CH1_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF00100A4u)

/** Alias (User Manual Name) for SDMA_BLK0_CH1_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_CHCR.
*/
#define	SDMA_CHCR001	(SDMA_BLK0_CH1_CHCR)

/** \\brief  A8, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH1_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF00100A8u)

/** Alias (User Manual Name) for SDMA_BLK0_CH1_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_CHICR.
*/
#define	SDMA_CHICR001	(SDMA_BLK0_CH1_CHICR)

/** \\brief  A0, SDMA Channel Status Register */
#define SDMA_BLK0_CH1_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF00100A0u)

/** Alias (User Manual Name) for SDMA_BLK0_CH1_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_CHSR.
*/
#define	SDMA_CHSR001	(SDMA_BLK0_CH1_CHSR)

/** \\brief  B4, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH1_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF00100B4u)

/** Alias (User Manual Name) for SDMA_BLK0_CH1_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_DADR.
*/
#define	SDMA_DADR001	(SDMA_BLK0_CH1_DADR)

/** \\brief  B0, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH1_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF00100B0u)

