HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** Alias (User Manual Name) for SDMA_BLK0_CH1_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_SADR.
*/
#define	SDMA_SADR001	(SDMA_BLK0_CH1_SADR)

/** \\brief  B8, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH1_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF00100B8u)

/** Alias (User Manual Name) for SDMA_BLK0_CH1_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH1_SHADR.
*/
#define	SDMA_SHADR001	(SDMA_BLK0_CH1_SHADR)

/** \\brief  CC, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH2_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF00100CCu)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_ADRCR.
*/
#define	SDMA_ADRCR002	(SDMA_BLK0_CH2_ADRCR)

/** \\brief  C4, SDMA Channel Control Register */
#define SDMA_BLK0_CH2_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF00100C4u)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_CHCR.
*/
#define	SDMA_CHCR002	(SDMA_BLK0_CH2_CHCR)

/** \\brief  C8, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH2_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF00100C8u)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_CHICR.
*/
#define	SDMA_CHICR002	(SDMA_BLK0_CH2_CHICR)

/** \\brief  C0, SDMA Channel Status Register */
#define SDMA_BLK0_CH2_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF00100C0u)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_CHSR.
*/
#define	SDMA_CHSR002	(SDMA_BLK0_CH2_CHSR)

/** \\brief  D4, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH2_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF00100D4u)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_DADR.
*/
#define	SDMA_DADR002	(SDMA_BLK0_CH2_DADR)

/** \\brief  D0, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH2_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF00100D0u)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_SADR.
*/
#define	SDMA_SADR002	(SDMA_BLK0_CH2_SADR)

/** \\brief  D8, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH2_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF00100D8u)

/** Alias (User Manual Name) for SDMA_BLK0_CH2_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH2_SHADR.
*/
#define	SDMA_SHADR002	(SDMA_BLK0_CH2_SHADR)

/** \\brief  EC, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH3_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF00100ECu)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_ADRCR.
*/
#define	SDMA_ADRCR003	(SDMA_BLK0_CH3_ADRCR)

/** \\brief  E4, SDMA Channel Control Register */
#define SDMA_BLK0_CH3_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF00100E4u)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_CHCR.
*/
#define	SDMA_CHCR003	(SDMA_BLK0_CH3_CHCR)

/** \\brief  E8, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH3_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF00100E8u)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_CHICR.
*/
#define	SDMA_CHICR003	(SDMA_BLK0_CH3_CHICR)

/** \\brief  E0, SDMA Channel Status Register */
#define SDMA_BLK0_CH3_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF00100E0u)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_CHSR.
*/
#define	SDMA_CHSR003	(SDMA_BLK0_CH3_CHSR)

/** \\brief  F4, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH3_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF00100F4u)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_DADR.
*/
#define	SDMA_DADR003	(SDMA_BLK0_CH3_DADR)

/** \\brief  F0, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH3_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF00100F0u)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_SADR.
*/
#define	SDMA_SADR003	(SDMA_BLK0_CH3_SADR)

/** \\brief  F8, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH3_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF00100F8u)

/** Alias (User Manual Name) for SDMA_BLK0_CH3_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH3_SHADR.
*/
#define	SDMA_SHADR003	(SDMA_BLK0_CH3_SHADR)

/** \\brief  10C, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH4_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001010Cu)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_ADRCR.
*/
#define	SDMA_ADRCR004	(SDMA_BLK0_CH4_ADRCR)

/** \\brief  104, SDMA Channel Control Register */
#define SDMA_BLK0_CH4_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0010104u)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_CHCR.
*/
#define	SDMA_CHCR004	(SDMA_BLK0_CH4_CHCR)

/** \\brief  108, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH4_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0010108u)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_CHICR.
*/
#define	SDMA_CHICR004	(SDMA_BLK0_CH4_CHICR)

