HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** \\brief  100, SDMA Channel Status Register */
#define SDMA_BLK0_CH4_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0010100u)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_CHSR.
*/
#define	SDMA_CHSR004	(SDMA_BLK0_CH4_CHSR)

/** \\brief  114, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH4_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0010114u)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_DADR.
*/
#define	SDMA_DADR004	(SDMA_BLK0_CH4_DADR)

/** \\brief  110, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH4_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0010110u)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_SADR.
*/
#define	SDMA_SADR004	(SDMA_BLK0_CH4_SADR)

/** \\brief  118, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH4_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0010118u)

/** Alias (User Manual Name) for SDMA_BLK0_CH4_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH4_SHADR.
*/
#define	SDMA_SHADR004	(SDMA_BLK0_CH4_SHADR)

/** \\brief  12C, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH5_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001012Cu)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_ADRCR.
*/
#define	SDMA_ADRCR005	(SDMA_BLK0_CH5_ADRCR)

/** \\brief  124, SDMA Channel Control Register */
#define SDMA_BLK0_CH5_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0010124u)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_CHCR.
*/
#define	SDMA_CHCR005	(SDMA_BLK0_CH5_CHCR)

/** \\brief  128, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH5_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0010128u)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_CHICR.
*/
#define	SDMA_CHICR005	(SDMA_BLK0_CH5_CHICR)

/** \\brief  120, SDMA Channel Status Register */
#define SDMA_BLK0_CH5_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0010120u)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_CHSR.
*/
#define	SDMA_CHSR005	(SDMA_BLK0_CH5_CHSR)

/** \\brief  134, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH5_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0010134u)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_DADR.
*/
#define	SDMA_DADR005	(SDMA_BLK0_CH5_DADR)

/** \\brief  130, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH5_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0010130u)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_SADR.
*/
#define	SDMA_SADR005	(SDMA_BLK0_CH5_SADR)

/** \\brief  138, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH5_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0010138u)

/** Alias (User Manual Name) for SDMA_BLK0_CH5_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH5_SHADR.
*/
#define	SDMA_SHADR005	(SDMA_BLK0_CH5_SHADR)

/** \\brief  14C, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH6_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001014Cu)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_ADRCR.
*/
#define	SDMA_ADRCR006	(SDMA_BLK0_CH6_ADRCR)

/** \\brief  144, SDMA Channel Control Register */
#define SDMA_BLK0_CH6_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0010144u)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_CHCR.
*/
#define	SDMA_CHCR006	(SDMA_BLK0_CH6_CHCR)

/** \\brief  148, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH6_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0010148u)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_CHICR.
*/
#define	SDMA_CHICR006	(SDMA_BLK0_CH6_CHICR)

/** \\brief  140, SDMA Channel Status Register */
#define SDMA_BLK0_CH6_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0010140u)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_CHSR.
*/
#define	SDMA_CHSR006	(SDMA_BLK0_CH6_CHSR)

/** \\brief  154, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH6_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0010154u)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_DADR.
*/
#define	SDMA_DADR006	(SDMA_BLK0_CH6_DADR)

/** \\brief  150, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH6_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0010150u)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_SADR.
*/
#define	SDMA_SADR006	(SDMA_BLK0_CH6_SADR)

/** \\brief  158, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH6_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0010158u)

/** Alias (User Manual Name) for SDMA_BLK0_CH6_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH6_SHADR.
*/
#define	SDMA_SHADR006	(SDMA_BLK0_CH6_SHADR)

/** \\brief  16C, SDMA Channel Address Control Register */
#define SDMA_BLK0_CH7_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001016Cu)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_ADRCR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_ADRCR.
*/
#define	SDMA_ADRCR007	(SDMA_BLK0_CH7_ADRCR)

