HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** \\brief  164, SDMA Channel Control Register */
#define SDMA_BLK0_CH7_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0010164u)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_CHCR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_CHCR.
*/
#define	SDMA_CHCR007	(SDMA_BLK0_CH7_CHCR)

/** \\brief  168, SDMA Channel Interrupt Control Register */
#define SDMA_BLK0_CH7_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0010168u)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_CHICR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_CHICR.
*/
#define	SDMA_CHICR007	(SDMA_BLK0_CH7_CHICR)

/** \\brief  160, SDMA Channel Status Register */
#define SDMA_BLK0_CH7_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0010160u)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_CHSR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_CHSR.
*/
#define	SDMA_CHSR007	(SDMA_BLK0_CH7_CHSR)

/** \\brief  174, SDMA Channel Destination Address Register */
#define SDMA_BLK0_CH7_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0010174u)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_DADR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_DADR.
*/
#define	SDMA_DADR007	(SDMA_BLK0_CH7_DADR)

/** \\brief  170, SDMA Channel Source Address Register */
#define SDMA_BLK0_CH7_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0010170u)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_SADR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_SADR.
*/
#define	SDMA_SADR007	(SDMA_BLK0_CH7_SADR)

/** \\brief  178, SDMA Channel Shadow Address Register */
#define SDMA_BLK0_CH7_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0010178u)

/** Alias (User Manual Name) for SDMA_BLK0_CH7_SHADR.
* To use register names with standard convension, please use SDMA_BLK0_CH7_SHADR.
*/
#define	SDMA_SHADR007	(SDMA_BLK0_CH7_SHADR)

/** \\brief  70, SDMA Channel Interrupt Set Register0 */
#define SDMA_BLK0_CHINTR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CHINTR0*)0xF0010070u)

/** Alias (User Manual Name) for SDMA_BLK0_CHINTR0.
* To use register names with standard convension, please use SDMA_BLK0_CHINTR0.
*/
#define	SDMA_CHINTR00	(SDMA_BLK0_CHINTR0)

/** \\brief  40, SDMA Channel Reset Request Register0 */
#define SDMA_BLK0_CHRSTR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CHRSTR0*)0xF0010040u)

/** Alias (User Manual Name) for SDMA_BLK0_CHRSTR0.
* To use register names with standard convension, please use SDMA_BLK0_CHRSTR0.
*/
#define	SDMA_CHRSTR00	(SDMA_BLK0_CHRSTR0)

/** \\brief  28, SDMA Clear Error Register */
#define SDMA_BLK0_CLRE /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CLRE*)0xF0010028u)

/** Alias (User Manual Name) for SDMA_BLK0_CLRE.
* To use register names with standard convension, please use SDMA_BLK0_CLRE.
*/
#define	SDMA_CLRE0	(SDMA_BLK0_CLRE)

/** \\brief  20, SDMA Enable Error Register */
#define SDMA_BLK0_EER /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_EER*)0xF0010020u)

/** Alias (User Manual Name) for SDMA_BLK0_EER.
* To use register names with standard convension, please use SDMA_BLK0_EER.
*/
#define	SDMA_EER0	(SDMA_BLK0_EER)

/** \\brief  24, SDMA Error Status Register */
#define SDMA_BLK0_ERRSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ERRSR*)0xF0010024u)

/** Alias (User Manual Name) for SDMA_BLK0_ERRSR.
* To use register names with standard convension, please use SDMA_BLK0_ERRSR.
*/
#define	SDMA_ERRSR0	(SDMA_BLK0_ERRSR)

/** \\brief  38, SDMA Move Engine Interrupt Set Register */
#define SDMA_BLK0_ME_INTR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_INTR*)0xF0010038u)

/** Alias (User Manual Name) for SDMA_BLK0_ME_INTR.
* To use register names with standard convension, please use SDMA_BLK0_ME_INTR.
*/
#define	SDMA_ME0INTR	(SDMA_BLK0_ME_INTR)

/** \\brief  3C, SDMA Move Engine Pattern Read Register */
#define SDMA_BLK0_ME_PR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_PR*)0xF001003Cu)

/** Alias (User Manual Name) for SDMA_BLK0_ME_PR.
* To use register names with standard convension, please use SDMA_BLK0_ME_PR.
*/
#define	SDMA_ME0PR	(SDMA_BLK0_ME_PR)

/** \\brief  34, SDMA Move Engine Read Register */
#define SDMA_BLK0_ME_R /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_R*)0xF0010034u)

/** Alias (User Manual Name) for SDMA_BLK0_ME_R.
* To use register names with standard convension, please use SDMA_BLK0_ME_R.
*/
#define	SDMA_ME0R	(SDMA_BLK0_ME_R)

/** \\brief  30, SDMA Move Engine Status Register */
#define SDMA_BLK0_ME_SR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_SR*)0xF0010030u)

/** Alias (User Manual Name) for SDMA_BLK0_ME_SR.
* To use register names with standard convension, please use SDMA_BLK0_ME_SR.
*/
#define	SDMA_ME0SR	(SDMA_BLK0_ME_SR)

/** \\brief  68, SDMA Suspend Acknowledge Register0 */
#define SDMA_BLK0_SUSACR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_SUSACR0*)0xF0010068u)

/** Alias (User Manual Name) for SDMA_BLK0_SUSACR0.
* To use register names with standard convension, please use SDMA_BLK0_SUSACR0.
*/
#define	SDMA_SUSACR00	(SDMA_BLK0_SUSACR0)

/** \\brief  60, SDMA Suspend Enable Register0 */
#define SDMA_BLK0_SUSENR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_SUSENR0*)0xF0010060u)

/** Alias (User Manual Name) for SDMA_BLK0_SUSENR0.
* To use register names with standard convension, please use SDMA_BLK0_SUSENR0.
*/
#define	SDMA_SUSENR00	(SDMA_BLK0_SUSENR0)

/** \\brief  18FC, SDMA Sub-block Access Enable Register 0 */
#define SDMA_BLK1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ACCEN0*)0xF00118FCu)

/** Alias (User Manual Name) for SDMA_BLK1_ACCEN0.
* To use register names with standard convension, please use SDMA_BLK1_ACCEN0.
*/
#define	SDMA_ACCEN10	(SDMA_BLK1_ACCEN0)

/** \\brief  18F8, SDMA Sub-block Access Enable Register 1 */
#define SDMA_BLK1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ACCEN1*)0xF00118F8u)

/** Alias (User Manual Name) for SDMA_BLK1_ACCEN1.
* To use register names with standard convension, please use SDMA_BLK1_ACCEN1.
*/
#define	SDMA_ACCEN11	(SDMA_BLK1_ACCEN1)

/** \\brief  108C, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH0_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001108Cu)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_ADRCR.
*/
#define	SDMA_ADRCR100	(SDMA_BLK1_CH0_ADRCR)

