HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** \\brief  1084, SDMA Channel Control Register */
#define SDMA_BLK1_CH0_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0011084u)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_CHCR.
*/
#define	SDMA_CHCR100	(SDMA_BLK1_CH0_CHCR)

/** \\brief  1088, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH0_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0011088u)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_CHICR.
*/
#define	SDMA_CHICR100	(SDMA_BLK1_CH0_CHICR)

/** \\brief  1080, SDMA Channel Status Register */
#define SDMA_BLK1_CH0_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0011080u)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_CHSR.
*/
#define	SDMA_CHSR100	(SDMA_BLK1_CH0_CHSR)

/** \\brief  1094, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH0_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0011094u)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_DADR.
*/
#define	SDMA_DADR100	(SDMA_BLK1_CH0_DADR)

/** \\brief  1090, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH0_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0011090u)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_SADR.
*/
#define	SDMA_SADR100	(SDMA_BLK1_CH0_SADR)

/** \\brief  1098, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH0_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0011098u)

/** Alias (User Manual Name) for SDMA_BLK1_CH0_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH0_SHADR.
*/
#define	SDMA_SHADR100	(SDMA_BLK1_CH0_SHADR)

/** \\brief  10AC, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH1_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF00110ACu)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_ADRCR.
*/
#define	SDMA_ADRCR101	(SDMA_BLK1_CH1_ADRCR)

/** \\brief  10A4, SDMA Channel Control Register */
#define SDMA_BLK1_CH1_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF00110A4u)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_CHCR.
*/
#define	SDMA_CHCR101	(SDMA_BLK1_CH1_CHCR)

/** \\brief  10A8, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH1_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF00110A8u)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_CHICR.
*/
#define	SDMA_CHICR101	(SDMA_BLK1_CH1_CHICR)

/** \\brief  10A0, SDMA Channel Status Register */
#define SDMA_BLK1_CH1_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF00110A0u)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_CHSR.
*/
#define	SDMA_CHSR101	(SDMA_BLK1_CH1_CHSR)

/** \\brief  10B4, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH1_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF00110B4u)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_DADR.
*/
#define	SDMA_DADR101	(SDMA_BLK1_CH1_DADR)

/** \\brief  10B0, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH1_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF00110B0u)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_SADR.
*/
#define	SDMA_SADR101	(SDMA_BLK1_CH1_SADR)

/** \\brief  10B8, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH1_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF00110B8u)

/** Alias (User Manual Name) for SDMA_BLK1_CH1_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH1_SHADR.
*/
#define	SDMA_SHADR101	(SDMA_BLK1_CH1_SHADR)

/** \\brief  10CC, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH2_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF00110CCu)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_ADRCR.
*/
#define	SDMA_ADRCR102	(SDMA_BLK1_CH2_ADRCR)

/** \\brief  10C4, SDMA Channel Control Register */
#define SDMA_BLK1_CH2_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF00110C4u)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_CHCR.
*/
#define	SDMA_CHCR102	(SDMA_BLK1_CH2_CHCR)

/** \\brief  10C8, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH2_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF00110C8u)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_CHICR.
*/
#define	SDMA_CHICR102	(SDMA_BLK1_CH2_CHICR)

/** \\brief  10C0, SDMA Channel Status Register */
#define SDMA_BLK1_CH2_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF00110C0u)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_CHSR.
*/
#define	SDMA_CHSR102	(SDMA_BLK1_CH2_CHSR)

/** \\brief  10D4, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH2_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF00110D4u)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_DADR.
*/
#define	SDMA_DADR102	(SDMA_BLK1_CH2_DADR)

/** \\brief  10D0, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH2_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF00110D0u)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_SADR.
*/
#define	SDMA_SADR102	(SDMA_BLK1_CH2_SADR)

/** \\brief  10D8, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH2_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF00110D8u)

/** Alias (User Manual Name) for SDMA_BLK1_CH2_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH2_SHADR.
*/
#define	SDMA_SHADR102	(SDMA_BLK1_CH2_SHADR)

