HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** \\brief  10EC, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH3_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF00110ECu)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_ADRCR.
*/
#define	SDMA_ADRCR103	(SDMA_BLK1_CH3_ADRCR)

/** \\brief  10E4, SDMA Channel Control Register */
#define SDMA_BLK1_CH3_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF00110E4u)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_CHCR.
*/
#define	SDMA_CHCR103	(SDMA_BLK1_CH3_CHCR)

/** \\brief  10E8, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH3_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF00110E8u)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_CHICR.
*/
#define	SDMA_CHICR103	(SDMA_BLK1_CH3_CHICR)

/** \\brief  10E0, SDMA Channel Status Register */
#define SDMA_BLK1_CH3_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF00110E0u)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_CHSR.
*/
#define	SDMA_CHSR103	(SDMA_BLK1_CH3_CHSR)

/** \\brief  10F4, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH3_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF00110F4u)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_DADR.
*/
#define	SDMA_DADR103	(SDMA_BLK1_CH3_DADR)

/** \\brief  10F0, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH3_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF00110F0u)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_SADR.
*/
#define	SDMA_SADR103	(SDMA_BLK1_CH3_SADR)

/** \\brief  10F8, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH3_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF00110F8u)

/** Alias (User Manual Name) for SDMA_BLK1_CH3_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH3_SHADR.
*/
#define	SDMA_SHADR103	(SDMA_BLK1_CH3_SHADR)

/** \\brief  110C, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH4_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001110Cu)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_ADRCR.
*/
#define	SDMA_ADRCR104	(SDMA_BLK1_CH4_ADRCR)

/** \\brief  1104, SDMA Channel Control Register */
#define SDMA_BLK1_CH4_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0011104u)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_CHCR.
*/
#define	SDMA_CHCR104	(SDMA_BLK1_CH4_CHCR)

/** \\brief  1108, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH4_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0011108u)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_CHICR.
*/
#define	SDMA_CHICR104	(SDMA_BLK1_CH4_CHICR)

/** \\brief  1100, SDMA Channel Status Register */
#define SDMA_BLK1_CH4_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0011100u)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_CHSR.
*/
#define	SDMA_CHSR104	(SDMA_BLK1_CH4_CHSR)

/** \\brief  1114, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH4_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0011114u)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_DADR.
*/
#define	SDMA_DADR104	(SDMA_BLK1_CH4_DADR)

/** \\brief  1110, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH4_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0011110u)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_SADR.
*/
#define	SDMA_SADR104	(SDMA_BLK1_CH4_SADR)

/** \\brief  1118, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH4_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0011118u)

/** Alias (User Manual Name) for SDMA_BLK1_CH4_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH4_SHADR.
*/
#define	SDMA_SHADR104	(SDMA_BLK1_CH4_SHADR)

/** \\brief  112C, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH5_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001112Cu)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_ADRCR.
*/
#define	SDMA_ADRCR105	(SDMA_BLK1_CH5_ADRCR)

/** \\brief  1124, SDMA Channel Control Register */
#define SDMA_BLK1_CH5_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0011124u)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_CHCR.
*/
#define	SDMA_CHCR105	(SDMA_BLK1_CH5_CHCR)

/** \\brief  1128, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH5_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0011128u)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_CHICR.
*/
#define	SDMA_CHICR105	(SDMA_BLK1_CH5_CHICR)

/** \\brief  1120, SDMA Channel Status Register */
#define SDMA_BLK1_CH5_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0011120u)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_CHSR.
*/
#define	SDMA_CHSR105	(SDMA_BLK1_CH5_CHSR)

