HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** \\brief  1134, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH5_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0011134u)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_DADR.
*/
#define	SDMA_DADR105	(SDMA_BLK1_CH5_DADR)

/** \\brief  1130, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH5_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0011130u)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_SADR.
*/
#define	SDMA_SADR105	(SDMA_BLK1_CH5_SADR)

/** \\brief  1138, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH5_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0011138u)

/** Alias (User Manual Name) for SDMA_BLK1_CH5_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH5_SHADR.
*/
#define	SDMA_SHADR105	(SDMA_BLK1_CH5_SHADR)

/** \\brief  114C, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH6_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001114Cu)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_ADRCR.
*/
#define	SDMA_ADRCR106	(SDMA_BLK1_CH6_ADRCR)

/** \\brief  1144, SDMA Channel Control Register */
#define SDMA_BLK1_CH6_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0011144u)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_CHCR.
*/
#define	SDMA_CHCR106	(SDMA_BLK1_CH6_CHCR)

/** \\brief  1148, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH6_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0011148u)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_CHICR.
*/
#define	SDMA_CHICR106	(SDMA_BLK1_CH6_CHICR)

/** \\brief  1140, SDMA Channel Status Register */
#define SDMA_BLK1_CH6_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0011140u)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_CHSR.
*/
#define	SDMA_CHSR106	(SDMA_BLK1_CH6_CHSR)

/** \\brief  1154, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH6_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0011154u)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_DADR.
*/
#define	SDMA_DADR106	(SDMA_BLK1_CH6_DADR)

/** \\brief  1150, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH6_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0011150u)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_SADR.
*/
#define	SDMA_SADR106	(SDMA_BLK1_CH6_SADR)

/** \\brief  1158, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH6_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0011158u)

/** Alias (User Manual Name) for SDMA_BLK1_CH6_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH6_SHADR.
*/
#define	SDMA_SHADR106	(SDMA_BLK1_CH6_SHADR)

/** \\brief  116C, SDMA Channel Address Control Register */
#define SDMA_BLK1_CH7_ADRCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_ADRCR*)0xF001116Cu)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_ADRCR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_ADRCR.
*/
#define	SDMA_ADRCR107	(SDMA_BLK1_CH7_ADRCR)

/** \\brief  1164, SDMA Channel Control Register */
#define SDMA_BLK1_CH7_CHCR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHCR*)0xF0011164u)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_CHCR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_CHCR.
*/
#define	SDMA_CHCR107	(SDMA_BLK1_CH7_CHCR)

/** \\brief  1168, SDMA Channel Interrupt Control Register */
#define SDMA_BLK1_CH7_CHICR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHICR*)0xF0011168u)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_CHICR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_CHICR.
*/
#define	SDMA_CHICR107	(SDMA_BLK1_CH7_CHICR)

/** \\brief  1160, SDMA Channel Status Register */
#define SDMA_BLK1_CH7_CHSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_CHSR*)0xF0011160u)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_CHSR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_CHSR.
*/
#define	SDMA_CHSR107	(SDMA_BLK1_CH7_CHSR)

/** \\brief  1174, SDMA Channel Destination Address Register */
#define SDMA_BLK1_CH7_DADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_DADR*)0xF0011174u)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_DADR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_DADR.
*/
#define	SDMA_DADR107	(SDMA_BLK1_CH7_DADR)

/** \\brief  1170, SDMA Channel Source Address Register */
#define SDMA_BLK1_CH7_SADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SADR*)0xF0011170u)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_SADR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_SADR.
*/
#define	SDMA_SADR107	(SDMA_BLK1_CH7_SADR)

/** \\brief  1178, SDMA Channel Shadow Address Register */
#define SDMA_BLK1_CH7_SHADR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CH_SHADR*)0xF0011178u)

/** Alias (User Manual Name) for SDMA_BLK1_CH7_SHADR.
* To use register names with standard convension, please use SDMA_BLK1_CH7_SHADR.
*/
#define	SDMA_SHADR107	(SDMA_BLK1_CH7_SHADR)

/** \\brief  1070, SDMA Channel Interrupt Set Register0 */
#define SDMA_BLK1_CHINTR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CHINTR0*)0xF0011070u)

/** Alias (User Manual Name) for SDMA_BLK1_CHINTR0.
* To use register names with standard convension, please use SDMA_BLK1_CHINTR0.
*/
#define	SDMA_CHINTR10	(SDMA_BLK1_CHINTR0)

