HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** \\brief  1040, SDMA Channel Reset Request Register0 */
#define SDMA_BLK1_CHRSTR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CHRSTR0*)0xF0011040u)

/** Alias (User Manual Name) for SDMA_BLK1_CHRSTR0.
* To use register names with standard convension, please use SDMA_BLK1_CHRSTR0.
*/
#define	SDMA_CHRSTR10	(SDMA_BLK1_CHRSTR0)

/** \\brief  1028, SDMA Clear Error Register */
#define SDMA_BLK1_CLRE /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_CLRE*)0xF0011028u)

/** Alias (User Manual Name) for SDMA_BLK1_CLRE.
* To use register names with standard convension, please use SDMA_BLK1_CLRE.
*/
#define	SDMA_CLRE1	(SDMA_BLK1_CLRE)

/** \\brief  1020, SDMA Enable Error Register */
#define SDMA_BLK1_EER /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_EER*)0xF0011020u)

/** Alias (User Manual Name) for SDMA_BLK1_EER.
* To use register names with standard convension, please use SDMA_BLK1_EER.
*/
#define	SDMA_EER1	(SDMA_BLK1_EER)

/** \\brief  1024, SDMA Error Status Register */
#define SDMA_BLK1_ERRSR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ERRSR*)0xF0011024u)

/** Alias (User Manual Name) for SDMA_BLK1_ERRSR.
* To use register names with standard convension, please use SDMA_BLK1_ERRSR.
*/
#define	SDMA_ERRSR1	(SDMA_BLK1_ERRSR)

/** \\brief  1038, SDMA Move Engine Interrupt Set Register */
#define SDMA_BLK1_ME_INTR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_INTR*)0xF0011038u)

/** Alias (User Manual Name) for SDMA_BLK1_ME_INTR.
* To use register names with standard convension, please use SDMA_BLK1_ME_INTR.
*/
#define	SDMA_ME1INTR	(SDMA_BLK1_ME_INTR)

/** \\brief  103C, SDMA Move Engine Pattern Read Register */
#define SDMA_BLK1_ME_PR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_PR*)0xF001103Cu)

/** Alias (User Manual Name) for SDMA_BLK1_ME_PR.
* To use register names with standard convension, please use SDMA_BLK1_ME_PR.
*/
#define	SDMA_ME1PR	(SDMA_BLK1_ME_PR)

/** \\brief  1034, SDMA Move Engine Read Register */
#define SDMA_BLK1_ME_R /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_R*)0xF0011034u)

/** Alias (User Manual Name) for SDMA_BLK1_ME_R.
* To use register names with standard convension, please use SDMA_BLK1_ME_R.
*/
#define	SDMA_ME1R	(SDMA_BLK1_ME_R)

/** \\brief  1030, SDMA Move Engine Status Register */
#define SDMA_BLK1_ME_SR /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_ME_SR*)0xF0011030u)

/** Alias (User Manual Name) for SDMA_BLK1_ME_SR.
* To use register names with standard convension, please use SDMA_BLK1_ME_SR.
*/
#define	SDMA_ME1SR	(SDMA_BLK1_ME_SR)

/** \\brief  1068, SDMA Suspend Acknowledge Register0 */
#define SDMA_BLK1_SUSACR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_SUSACR0*)0xF0011068u)

/** Alias (User Manual Name) for SDMA_BLK1_SUSACR0.
* To use register names with standard convension, please use SDMA_BLK1_SUSACR0.
*/
#define	SDMA_SUSACR10	(SDMA_BLK1_SUSACR0)

/** \\brief  1060, SDMA Suspend Enable Register0 */
#define SDMA_BLK1_SUSENR0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_BLK_SUSENR0*)0xF0011060u)

/** Alias (User Manual Name) for SDMA_BLK1_SUSENR0.
* To use register names with standard convension, please use SDMA_BLK1_SUSENR0.
*/
#define	SDMA_SUSENR10	(SDMA_BLK1_SUSENR0)

/** \\brief  0, SDMA Sub-block 0 Clock Control Register */
#define SDMA_CLC0 /*lint --e(923)*/ (*(volatile Ifx_SDMA_CLC0*)0xF0010000u)

/** \\brief  1000, SDMA Sub-block 1 Clock Control Register */
#define SDMA_CLC1 /*lint --e(923)*/ (*(volatile Ifx_SDMA_CLC1*)0xF0011000u)

/** \\brief  2018, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH00_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012018u)

/** Alias (User Manual Name) for SDMA_CRCCH00_RD.
* To use register names with standard convension, please use SDMA_CRCCH00_RD.
*/
#define	SDMA_RDCRC000	(SDMA_CRCCH00_RD)

/** \\brief  201C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH00_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001201Cu)

/** Alias (User Manual Name) for SDMA_CRCCH00_SD.
* To use register names with standard convension, please use SDMA_CRCCH00_SD.
*/
#define	SDMA_SDCRC000	(SDMA_CRCCH00_SD)

/** \\brief  2038, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH01_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012038u)

/** Alias (User Manual Name) for SDMA_CRCCH01_RD.
* To use register names with standard convension, please use SDMA_CRCCH01_RD.
*/
#define	SDMA_RDCRC001	(SDMA_CRCCH01_RD)

/** \\brief  203C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH01_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001203Cu)

/** Alias (User Manual Name) for SDMA_CRCCH01_SD.
* To use register names with standard convension, please use SDMA_CRCCH01_SD.
*/
#define	SDMA_SDCRC001	(SDMA_CRCCH01_SD)

/** \\brief  2058, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH02_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012058u)

/** Alias (User Manual Name) for SDMA_CRCCH02_RD.
* To use register names with standard convension, please use SDMA_CRCCH02_RD.
*/
#define	SDMA_RDCRC002	(SDMA_CRCCH02_RD)

/** \\brief  205C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH02_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001205Cu)

/** Alias (User Manual Name) for SDMA_CRCCH02_SD.
* To use register names with standard convension, please use SDMA_CRCCH02_SD.
*/
#define	SDMA_SDCRC002	(SDMA_CRCCH02_SD)

/** \\brief  2078, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH03_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012078u)

/** Alias (User Manual Name) for SDMA_CRCCH03_RD.
* To use register names with standard convension, please use SDMA_CRCCH03_RD.
*/
#define	SDMA_RDCRC003	(SDMA_CRCCH03_RD)

/** \\brief  207C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH03_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001207Cu)

/** Alias (User Manual Name) for SDMA_CRCCH03_SD.
* To use register names with standard convension, please use SDMA_CRCCH03_SD.
*/
#define	SDMA_SDCRC003	(SDMA_CRCCH03_SD)

/** \\brief  2098, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH04_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012098u)

/** Alias (User Manual Name) for SDMA_CRCCH04_RD.
* To use register names with standard convension, please use SDMA_CRCCH04_RD.
*/
#define	SDMA_RDCRC004	(SDMA_CRCCH04_RD)

/** \\brief  209C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH04_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001209Cu)

