HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_reg.h
/** Alias (User Manual Name) for SDMA_CRCCH04_SD.
* To use register names with standard convension, please use SDMA_CRCCH04_SD.
*/
#define	SDMA_SDCRC004	(SDMA_CRCCH04_SD)

/** \\brief  20B8, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH05_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF00120B8u)

/** Alias (User Manual Name) for SDMA_CRCCH05_RD.
* To use register names with standard convension, please use SDMA_CRCCH05_RD.
*/
#define	SDMA_RDCRC005	(SDMA_CRCCH05_RD)

/** \\brief  20BC, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH05_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF00120BCu)

/** Alias (User Manual Name) for SDMA_CRCCH05_SD.
* To use register names with standard convension, please use SDMA_CRCCH05_SD.
*/
#define	SDMA_SDCRC005	(SDMA_CRCCH05_SD)

/** \\brief  20D8, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH06_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF00120D8u)

/** Alias (User Manual Name) for SDMA_CRCCH06_RD.
* To use register names with standard convension, please use SDMA_CRCCH06_RD.
*/
#define	SDMA_RDCRC006	(SDMA_CRCCH06_RD)

/** \\brief  20DC, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH06_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF00120DCu)

/** Alias (User Manual Name) for SDMA_CRCCH06_SD.
* To use register names with standard convension, please use SDMA_CRCCH06_SD.
*/
#define	SDMA_SDCRC006	(SDMA_CRCCH06_SD)

/** \\brief  20F8, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH07_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF00120F8u)

/** Alias (User Manual Name) for SDMA_CRCCH07_RD.
* To use register names with standard convension, please use SDMA_CRCCH07_RD.
*/
#define	SDMA_RDCRC007	(SDMA_CRCCH07_RD)

/** \\brief  20FC, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH07_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF00120FCu)

/** Alias (User Manual Name) for SDMA_CRCCH07_SD.
* To use register names with standard convension, please use SDMA_CRCCH07_SD.
*/
#define	SDMA_SDCRC007	(SDMA_CRCCH07_SD)

/** \\brief  2818, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH10_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012818u)

/** Alias (User Manual Name) for SDMA_CRCCH10_RD.
* To use register names with standard convension, please use SDMA_CRCCH10_RD.
*/
#define	SDMA_RDCRC100	(SDMA_CRCCH10_RD)

/** \\brief  281C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH10_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001281Cu)

/** Alias (User Manual Name) for SDMA_CRCCH10_SD.
* To use register names with standard convension, please use SDMA_CRCCH10_SD.
*/
#define	SDMA_SDCRC100	(SDMA_CRCCH10_SD)

/** \\brief  2838, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH11_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012838u)

/** Alias (User Manual Name) for SDMA_CRCCH11_RD.
* To use register names with standard convension, please use SDMA_CRCCH11_RD.
*/
#define	SDMA_RDCRC101	(SDMA_CRCCH11_RD)

/** \\brief  283C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH11_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001283Cu)

/** Alias (User Manual Name) for SDMA_CRCCH11_SD.
* To use register names with standard convension, please use SDMA_CRCCH11_SD.
*/
#define	SDMA_SDCRC101	(SDMA_CRCCH11_SD)

/** \\brief  2858, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH12_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012858u)

/** Alias (User Manual Name) for SDMA_CRCCH12_RD.
* To use register names with standard convension, please use SDMA_CRCCH12_RD.
*/
#define	SDMA_RDCRC102	(SDMA_CRCCH12_RD)

/** \\brief  285C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH12_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001285Cu)

/** Alias (User Manual Name) for SDMA_CRCCH12_SD.
* To use register names with standard convension, please use SDMA_CRCCH12_SD.
*/
#define	SDMA_SDCRC102	(SDMA_CRCCH12_SD)

/** \\brief  2878, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH13_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012878u)

/** Alias (User Manual Name) for SDMA_CRCCH13_RD.
* To use register names with standard convension, please use SDMA_CRCCH13_RD.
*/
#define	SDMA_RDCRC103	(SDMA_CRCCH13_RD)

/** \\brief  287C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH13_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001287Cu)

/** Alias (User Manual Name) for SDMA_CRCCH13_SD.
* To use register names with standard convension, please use SDMA_CRCCH13_SD.
*/
#define	SDMA_SDCRC103	(SDMA_CRCCH13_SD)

/** \\brief  2898, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH14_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF0012898u)

/** Alias (User Manual Name) for SDMA_CRCCH14_RD.
* To use register names with standard convension, please use SDMA_CRCCH14_RD.
*/
#define	SDMA_RDCRC104	(SDMA_CRCCH14_RD)

/** \\brief  289C, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH14_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF001289Cu)

/** Alias (User Manual Name) for SDMA_CRCCH14_SD.
* To use register names with standard convension, please use SDMA_CRCCH14_SD.
*/
#define	SDMA_SDCRC104	(SDMA_CRCCH14_SD)

/** \\brief  28B8, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH15_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF00128B8u)

/** Alias (User Manual Name) for SDMA_CRCCH15_RD.
* To use register names with standard convension, please use SDMA_CRCCH15_RD.
*/
#define	SDMA_RDCRC105	(SDMA_CRCCH15_RD)

/** \\brief  28BC, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH15_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF00128BCu)

/** Alias (User Manual Name) for SDMA_CRCCH15_SD.
* To use register names with standard convension, please use SDMA_CRCCH15_SD.
*/
#define	SDMA_SDCRC105	(SDMA_CRCCH15_SD)

/** \\brief  28D8, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH16_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF00128D8u)

/** Alias (User Manual Name) for SDMA_CRCCH16_RD.
* To use register names with standard convension, please use SDMA_CRCCH16_RD.
*/
#define	SDMA_RDCRC106	(SDMA_CRCCH16_RD)

/** \\brief  28DC, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH16_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF00128DCu)

/** Alias (User Manual Name) for SDMA_CRCCH16_SD.
* To use register names with standard convension, please use SDMA_CRCCH16_SD.
*/
#define	SDMA_SDCRC106	(SDMA_CRCCH16_SD)

/** \\brief  28F8, SDMA Channel Read Data CRC Register */
#define SDMA_CRCCH17_RD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_RD*)0xF00128F8u)

/** Alias (User Manual Name) for SDMA_CRCCH17_RD.
* To use register names with standard convension, please use SDMA_CRCCH17_RD.
*/
#define	SDMA_RDCRC107	(SDMA_CRCCH17_RD)

/** \\brief  28FC, SDMA Channel Source and Destination Address CRC Register */
#define SDMA_CRCCH17_SD /*lint --e(923)*/ (*(volatile Ifx_SDMA_CRCCH_SD*)0xF00128FCu)

/** Alias (User Manual Name) for SDMA_CRCCH17_SD.
* To use register names with standard convension, please use SDMA_CRCCH17_SD.
*/
#define	SDMA_SDCRC107	(SDMA_CRCCH17_SD)

/** \\brief  8, Module Identification Register */
#define SDMA_ID /*lint --e(923)*/ (*(volatile Ifx_SDMA_ID*)0xF0010008u)

/** \\brief  C, SDMA OCDS Trigger Set Select */
#define SDMA_OTSS /*lint --e(923)*/ (*(volatile Ifx_SDMA_OTSS*)0xF001000Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSDMA_REG_H */
